<h1>Interview Questions</h1>

<h3>1</h3> Given a list with missing values:

L = [10, , 8, -5 , , 20]

• select: “-1” for the missing values

• with / without loops (desirable with no loops)

In [59]:
#! pip install pandas
#! pip install numpy

In [85]:
import pandas as pd
L=[10,None,8,-5,None,20]
df = pd.DataFrame(L, columns = ["my_list"])
df

   my_list
0     10.0
1      NaN
2      8.0
3     -5.0
4      NaN
5     20.0

In [77]:
df.isnull()

0    10.0
1    -1.0
2     8.0
3    -5.0
4    -1.0
5    20.0
Name: my_list, dtype: float64

In [79]:
#without loop
df1 = df.my_list.fillna(-1)
df1

0    10.0
1    -1.0
2     8.0
3    -5.0
4    -1.0
5    20.0
Name: my_list, dtype: float64

In [108]:
L
range(len(L))
L[5]

20

In [123]:
#with loop
for x in range(len(L)):
    if L[x]== None:
        L[x] = -1       
L

[10, -1, 8, -5, -1, 20]

# 2 
Write a program that prints the numbers from 1 to 100.

• for multiples of three: print “Hello” instead of the number

• for the multiples of five: print “World”.

• And for numbers multiples of both (three and five): print “Hello World”.

In [41]:
import numpy as np

N=np.arange(0,21,1)

N=N.tolist()

for num in N: # or for num in range(0,21):
    
    if num%3 == 0:
        print("Hello "*num)
    elif num%5 == 0:
        print("World "*num)
    elif num%5 == 0 or num%3 == 0:
        print("Hello World "*num)

Hello Hello Hello
World World World World World
Hello Hello Hello Hello Hello Hello
Hello Hello Hello Hello Hello Hello Hello Hello Hello
World World World World World World World World World World
Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello
Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello
Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello Hello
World World World World World World World World World World World World World World World World World World World World

# 4 Select the function that runs faster. (execution).
(similar to the exercise of the job interview)
not exactly the same

In [1]:
import time

def func1():
    x = time.time() # before execution
    
    for i in range(10**8):
        pass
    
    y = time.time() # after execution 
    print(y-x)

import numpy as np
    
def func2():
    x1 = time.time() # before execution
    
    for i in np.arange(10**8):
        pass
    
    y1 = time.time() # after execution 
    print(y1-x1)
    
func1()
func2()

1.942883014678955
4.098750352859497

# 5 Count number of occurence of element in list
Given this list:
L = [10,20,20,30,40,40,40,50]

• Count the number of occurrences (for all of them)

In [30]:
L = [10,20,20,30,40,40,40,50]

#[1, 2, 3, 4, 1, 4, 1].count(1)
#3

def num_occ_cnt(num_list):
    counts = {}
    
    for num in set(num_list):   # set to get distinct lsit           
        counts[num] = L.count(num)     
    return counts

print(num_occ_cnt(L))

{40: 3, 10: 1, 50: 1, 20: 2, 30: 1}

In [38]:
#comprehension 

#using list comprehension 
print([[x,L.count(x)] for x in set(L)])

#using dict comprehension 
print(dict((x,L.count(x)) for x in set(L)))

[[40, 3], [10, 1], [50, 1], [20, 2], [30, 1]]
{40: 3, 10: 1, 50: 1, 20: 2, 30: 1}

In [47]:
#using panda
import pandas as pd

df = pd.DataFrame(L,columns = ["Number"])
df

   Number
0      10
1      20
2      20
3      30
4      40
5      40
6      40
7      50

In [ ]:
df.Number.value_counts()

In [58]:
df.groupby(['Number']).size().reset_index(name='counts')

   Number  counts
0      10       1
1      20       2
2      30       1
3      40       3
4      50       1

# 6 Given this list:
L = [10,20,30,40,50,60]

• Use Python to reverse the order of the list.

# 7 Given two strings:
• S1 = “Hi!”

• S2 = “Hello!”

Print the common letters

# 8 Given this list of numbers:
• L = [16, 34, 35, 9, 82, 60, 4, 18]

Your task is to do the following:

• Replace all the numbers that are divisible by 3 with “Hello”

• Replace all the numbers divisible by 5 with “World”

• Replace all the integers divisible by both 3 and 5 with “Hello World”

# 9 create dict fom lists

In [5]:
objects = ['blue', 'apple', 'dog']
categories = ['color', 'fruit', 'pet']
a_dict = {key: value for key, value in zip(categories, objects)}

# 10 Find second highest from each rows and columns

In [12]:

import numpy as np
import pandas as pd
np.random.seed(100)
df = pd.DataFrame(np.random.randint(10, size=(5,5)), columns=list('ABCDE'))
print(df)

   A  B  C  D  E
0  8  8  3  7  7
1  0  4  2  5  2
2  2  2  1  0  8
3  4  0  9  6  2
4  4  1  5  3  4

In [72]:
#first and second largest
pd.DataFrame(np.sort(df.values,axis=1)[:,-2:],columns=['2nd Largest','Largest'])

   2nd Largest  Largest
0            8        8
1            4        5
2            2        8
3            6        9
4            4        5

In [67]:
pd.DataFrame(np.sort(df.values,axis=1)[:,-1],columns=['1nd Largest'])

   1nd Largest
0            8
1            5
2            8
3            9
4            5

In [19]:
pd.DataFrame(np.sort(df.values,axis=1)[:,2],columns=['2nd Lowest'])

   2nd Lowest
0           7
1           2
2           2
3           4
4           4

Find second highest from each column???

In [65]:
df.nlargest(1,'A')

   A  B  C  D  E
0  8  8  3  7  7

In [59]:
pd.DataFrame(np.sort(df.values))

   0  1  2  3  4
0  3  7  7  8  8
1  0  2  2  4  5
2  0  1  2  2  8
3  0  2  4  6  9
4  1  3  4  4  5

# Word Count

In [21]:
test_str = 'it was the best of times it was the worst of times it was the age of wisdom it was the age of foolishness'
def word_cnt(str):
    counts ={}
    words = str.split ()
    
    for word in words:
        if word in counts:
            counts[word] +=1
        else:
           counts[word] = 1
    return counts

print(word_cnt(test_str))

{'it': 4, 'was': 4, 'the': 4, 'best': 1, 'of': 4, 'times': 2, 'worst': 1, 'age': 2, 'wisdom': 1, 'foolishness': 1}

# 11 print odd number warning

In [125]:
li = [2,4,6,8,12,15,16]

In [128]:
for n in li:
    if n%2 !=0:
        print(str(n) +' is Odd number')

15 is Odd number